tap "dart-lang/dart"
tap "felangel/mason"
tap "homebrew/bundle"
tap "homebrew/services"
tap "koekeishiya/formulae"
tap "leoafarias/fvm"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# Interpreted, interactive, object-oriented programming language
brew "python@3.12"
# Dependency manager for Cocoa projects
brew "cocoapods"
 Render markdown on the CLI
brew "glow"
# OpenType text shaping engine
brew "harfbuzz"
# Development kit for the Java programming language
brew "openjdk"
# Open-source build automation tool based on the Groovy and Kotlin DSL
brew "gradle"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Open source relational database management system
brew "mysql", restart_service: true
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Platform built on V8 to build network applications
brew "node"
# Development kit for the Java programming language
brew "openjdk@21"
# Persistent key-value database, with built-in net interface
brew "redis"
# Terminal multiplexer
brew "tmux"
# SDK
brew "dart-lang/dart/dart"
# A template generator which helps teams generate files quickly and consistently.
brew "felangel/mason/mason"
# Simple hotkey-daemon for macOS.
brew "koekeishiya/formulae/skhd"
# A tiling window manager for macOS based on binary space partitioning.
brew "koekeishiya/formulae/yabai"
# Simple cli to manage Flutter SDK versions per project
brew "leoafarias/fvm/fvm"

